config.org
# -*- mode: org; -*-
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

#+AUTHOR: Anthony Kalaitzis
#+TITLE: Emacs Config file

* Use Package

Load Use package in
#+BEGIN_SRC emacs-lisp
  ;; This is only needed once, near the top of the file
  (eval-when-compile
    ;; Following line is not needed if use-package.el is in ~/.emacs.d
    (add-to-list 'load-path "/home/anthony/.emacs.d/elpa/use-package-20180715.1801")
    (require 'use-package))
#+END_SRC

Ensure that main packages are loaded in
#+BEGIN_SRC emacs-lisp
  (use-package ace-window
    :ensure t)
  (use-package auto-package-update
    :ensure t)
  (use-package tex
    :ensure auctex)
  ;; (use-package exec-path-from-shell
  ;;   :ensure t)
  (use-package julia-mode
    :ensure t)
  (use-package julia-shell
    :ensure t)
  (use-package org-bullets
    :ensure t)
  (use-package rainbow-mode
    :ensure t)
  (use-package wolfram
    :ensure t)
  (use-package better-defaults
    :ensure t)
  (use-package pdf-tools
    :ensure t)
  (use-package rainbow-delimiters
    :ensure t)
  (use-package helm
    :ensure t)
  (use-package flyspell
    :ensure t)
  (use-package flycheck
    :ensure t)
  (use-package htmlize
    :ensure t)
  (use-package org
    :ensure t)
  (use-package god-mode
    :ensure t)
  (use-package monokai-theme
    :ensure t)
#+END_SRC

* Emacs Utility
** Language 

Enable quick changed between English and 日本語
#+BEGIN_SRC emacs-lisp
  ;; (set-language-environment "Japanese")
#+END_SRC

Set encoding environment to UTF-8
#+BEGIN_SRC emacs-lisp
  (set-language-environment "UTF-8")
#+END_SRC

** Extra

Add custom abbrev definitions
#+BEGIN_SRC emacs-lisp
(setq abbrev-file-name "~/.abbrev_defs")
(if (file-exists-p abbrev-file-name)
    (quietly-read-abbrev-file))
#+END_SRC

Add some custom load paths
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/elpa/")
#+END_SRC

Toggle between splits
#+BEGIN_SRC emacs-lisp
  (defun window-split-toggle ()
  "Toggle between horizontal and vertical split with two windows."
  (interactive)
  (if (> (length (window-list)) 2)
      (error "Can't toggle with more than 2 windows!")
    (let ((func (if (window-full-height-p)
                    #'split-window-vertically
                  #'split-window-horizontally)))
      (delete-other-windows)
      (funcall func)
      (save-selected-window
        (other-window 1)
        (switch-to-buffer (other-buffer))))))
#+END_SRC

Auto refresh buffers without asking
#+BEGIN_SRC emacs-lisp
  (global-auto-revert-mode t)
#+END_SRC

Display column number
#+BEGIN_SRC emacs-lisp
   (setq column-number-mode t)
#+END_SRC

General comment header for any language
#+BEGIN_SRC emacs-lisp
  (defun my/general-comment-header (title)
  "Inserts a commented title"
  (interactive "sEnter a title: ")
  (defvar dash-len 1)
  (setq dash-len (/ (- 68 (length title)) 2))
  (insert comment-start)
  (indent-for-tab-command)
  (dotimes (ii dash-len)
    (insert "-"))
  (if (= (mod (length title) 2) 1)
      (insert "-")
    )
  (insert title)
  (dotimes (ii dash-len)
    (insert "-"))
  )
(global-set-key (kbd "H-t") 'my/general-comment-header)
#+END_SRC

set wolfram alpha ID
#+BEGIN_SRC emacs-lisp
(require 'wolfram)
(setq wolfram-alpha-app-id 'U2773W-V74GXV4HWX)
#+END_SRC 

* Beautification
** Accessibility
Change text size in Emacs
#+BEGIN_SRC emacs-lisp
(set-face-attribute 'default nil :height 150)
#+END_SRC

camelCase recognition
#+BEGIN_SRC emacs-lisp
(global-subword-mode)
#+END_SRC

Turn on rainbow deliminators 
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
#+END_SRC

** Start up

Auto full screen Emacs GUI
#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (add-to-list 'default-frame-alist '(fullscreen . maximized)))
#+END_SRC

Don't show scroll bar
#+BEGIN_SRC emacs-lisp
(tool-bar-mode 0)
(menu-bar-mode 0)
(when window-system
  (scroll-bar-mode -1))
#+END_SRC

turn off Emacs's annoying bell
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
#+END_SRC

Fix Scrolling behaviour
#+BEGIN_SRC emacs-lisp
(setq scroll-conservatively 100)
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) 
(setq mouse-wheel-progressive-speed nil)
(setq mouse-wheel-follow-mouse 't) 
#+END_SRC

Remove start up message
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t)
(setq inhibit-startup-echo-area-message t)
#+END_SRC

Use better defaults for Emacs
#+BEGIN_SRC emacs-lisp
(require 'better-defaults)
#+END_SRC

** Display and Utility

Display time in mode line
#+BEGIN_SRC emacs-lisp
(setq display-time-string-forms '((propertize (format-time-string " %b %d, %l:%M%P" now) 'face'bold)))
(setq display-time-and-date t)
(display-time-mode 1)
#+END_SRC

Abbreviate all 'Yes/No' prompts to 'y/n'
#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

Display line numbers in programming modes
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
#+END_SRC

Mode line alterations
#+BEGIN_SRC emacs-lisp
(use-package spaceline
  :ensure spaceline
  :custom-face
  (spaceline-highlight-face ((t (:background "SeaGreen4" :foreground "#3E3D31" :inherit (quote mode-line)))))
  (spaceline-unmodified ((t (:background "SeaGreen4" :foreground "#3E3D31" :inherit (quote mode-line)))))
  (spaceline-read-only ((t (:background "DarkOliveGreen" :foreground "#3E3D31" :inherit (quote mode-line)))))
  :config
  (spaceline-emacs-theme)
  (setq spaceline-minor-modes-p nil)
  (setq spaceline-buffer-size-p nil)
  (setq spaceline-buffer-encoding-abbrev-p nil)
(setq spaceline-highlight-face-func 'spaceline-highlight-face-modified))
#+END_SRC
 
* Key Re-bindings
** File Navigation

Enable quick access to config file
#+BEGIN_SRC emacs-lisp
(defun my/visit-emacs-config ()
  (interactive)
  (find-file "~/.emacs.d/config.org"))
(global-set-key (kbd "H-e") 'my/visit-emacs-config)
#+END_SRC

File navigation for major files
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "H-r")  (lambda () (interactive) (find-file  "~/Dropbox/QMC/Thesis/MPhil_Research.tex")))
(global-set-key (kbd "H-T")  (lambda () (interactive) (find-file  "~/Dropbox/.texmf/tex/latex/package_repository/mypackage.sty")))
#+END_SRC

** Movement Macros

Move between buffers in same frame
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-]") 'other-window)
#+END_SRC

Move between buffers in different frames
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-[") 'other-frame)
#+END_SRC

Move in paragraphs
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-n") 'forward-paragraph)
(global-set-key (kbd "M-p") 'backward-paragraph)
#+END_SRC

ace window movement key bindings
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "H-]") 'ace-window)
(setq aw-keys '(?q ?w ?e ?a ?s ?d ?z ?x ?c))
#+END_SRC

** Personal Macros

Duplicate line
#+BEGIN_SRC emacs-lisp
(defun duplicate-current-line-or-region (arg)
  "Duplicates the current line or region ARG times.
If there's no region, the current line will be duplicated. However, if
there's a region, all lines that region covers will be duplicated."
  (interactive "p")
  (let (beg end (origin (point)))
    (if (and mark-active (> (point) (mark)))
        (exchange-point-and-mark))
    (setq beg (line-beginning-position))
    (if mark-active
        (exchange-point-and-mark))
    (setq end (line-end-position))
    (let ((region (buffer-substring-no-properties beg end)))
      (dotimes (i arg)
        (goto-char end)
        (newline)
        (insert region)
        (setq end (point)))
      (goto-char (+ origin (* (length region) arg) arg)))))
(global-set-key (kbd "H-D") 'duplicate-current-line-or-region)  
#+END_SRC

Open term in another window
#+BEGIN_SRC emacs-lisp
  (defun my/open-term-other-window ()
  (interactive)
  (let ((buf (term "/bin/bash")))
    (switch-to-buffer (other-buffer buf))
    (switch-to-buffer-other-window buf)))
(global-set-key (kbd "C-x 4 t") 'my/open-term-other-window)
#+END_SRC

Switch frame
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "H-f") 'window-split-toggle)
#+END_SRC

** Global coding macros

Repeat previous shell command
#+BEGIN_SRC emacs-lisp
(defun my/repeat-last-shell-command()
  "repeats last run shell command"
  (interactive)
  (shell-command (cadr (assoc 'shell-command command-history))))
(global-set-key (kbd "M-Z") 'my/repeat-last-shell-command)
#+END_SRC

Exchange below and above lines globally
#+BEGIN_SRC emacs-lisp
(defun move-line-up ()
  (interactive)
  (transpose-lines 1)
  (previous-line 2))

(defun move-line-down ()
  (interactive)
  (forward-line 1)
  (transpose-lines 1)
  (previous-line 1))

(global-set-key (kbd "M-<up>") 'move-line-up)
(global-set-key (kbd "M-<down>") 'move-line-down)
#+END_SRC

** God Mode

Some God mode commands
#+BEGIN_SRC emacs-lisp
(require 'god-mode)
(global-set-key (kbd "H-;") 'god-mode)
(define-key god-local-mode-map (kbd ".") 'repeat)
#+END_SRC

* Helm

Major configurations for the Helm Plugin
#+BEGIN_SRC emacs-lisp
(helm-mode 1)
(require 'helm)
(require 'helm-config)
(global-set-key (kbd "M-x") 'helm-M-x)
(global-set-key (kbd "C-x C-f") 'helm-find-files)
(global-set-key (kbd "C-x C-b") 'helm-buffers-list)
#+END_SRC

* Colour Theme

Load in custom colour theme
#+BEGIN_SRC emacs-lisp
(add-to-list 'custom-theme-load-path "~/.emacs.d/CustomTheme")
(load-theme 'anthony-swanking t)
#+END_SRC

* AucTex
** FlySpell

Enable spell checking for LaTex
#+BEGIN_SRC emacs-lisp
(dolist (hook '(text-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))
#+END_SRC

