config.el
;; This is only needed once, near the top of the file
(eval-when-compile
  ;; Following line is not needed if use-package.el is in ~/.emacs.d
  (add-to-list 'load-path "/home/anthony/.emacs.d/elpa/use-package-20180715.1801")
  (require 'use-package))

(use-package ace-window
  :ensure t)
(use-package auto-package-update
  :ensure t)
(use-package tex
  :ensure auctex)
(use-package exec-path-from-shell
  :ensure t)
(use-package julia-mode
  :ensure t)
(use-package julia-shell
  :ensure t)
(use-package org-bullets
  :ensure t)
(use-package rainbow-mode
  :ensure t)
(use-package wolfram
  :ensure t)
(use-package better-defaults
  :ensure t)
(use-package pdf-tools
  :ensure t)
(use-package rainbow-delimiters
  :ensure t)
(use-package helm
  :ensure t)
(use-package flyspell
  :ensure t)
(use-package htmlize
  :ensure t)
(use-package org
  :ensure t)
(use-package god-mode
  :ensure t)
(use-package monokai-theme
  :ensure t)

;; (set-language-environment "Japanese")

(set-language-environment "UTF-8")

(setq abbrev-file-name "~/.abbrev_defs")
(if (file-exists-p abbrev-file-name)
    (quietly-read-abbrev-file))

(add-to-list 'load-path "~/.emacs.d/elpa/")

(defun window-split-toggle ()
"Toggle between horizontal and vertical split with two windows."
(interactive)
(if (> (length (window-list)) 2)
    (error "Can't toggle with more than 2 windows!")
  (let ((func (if (window-full-height-p)
                  #'split-window-vertically
                #'split-window-horizontally)))
    (delete-other-windows)
    (funcall func)
    (save-selected-window
      (other-window 1)
      (switch-to-buffer (other-buffer))))))

(global-auto-revert-mode t)

(setq column-number-mode t)

(defun my/general-comment-header (title)
  "Inserts a commented title"
  (interactive "sEnter a title: ")
  (defvar dash-len 1)
  (setq dash-len (/ (- 68 (length title)) 2))
  (insert comment-start)
  (indent-for-tab-command)
  (dotimes (ii dash-len)
    (insert "-"))
  (if (= (mod (length title) 2) 1)
      (insert "-")
    )
  (insert title)
  (dotimes (ii dash-len)
    (insert "-"))
  )
(global-set-key (kbd "H-t") 'my/general-comment-header)

(require 'wolfram)
(setq wolfram-alpha-app-id 'U2773W-V74GXV4HWX)

(set-face-attribute 'default nil :height 150)

(global-subword-mode)

(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)

(when (display-graphic-p)
  (add-to-list 'default-frame-alist '(fullscreen . maximized)))

(tool-bar-mode 0)
(menu-bar-mode 0)
(when window-system
  (scroll-bar-mode -1))

(setq ring-bell-function 'ignore)

(setq scroll-conservatively 100)
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) 
(setq mouse-wheel-progressive-speed nil)
(setq mouse-wheel-follow-mouse 't)

(setq inhibit-startup-message t)
(setq inhibit-startup-echo-area-message t)

(require 'better-defaults)

(setq display-time-string-forms '((propertize (format-time-string " %b %d, %l:%M%P" now) 'face'bold)))
(setq display-time-and-date t)
(display-time-mode 1)

(fset 'yes-or-no-p 'y-or-n-p)

(add-hook 'prog-mode-hook 'display-line-numbers-mode)

;; (sml/setup)

(defun my/visit-emacs-config ()
  (interactive)
  (find-file "~/.emacs.d/config.org"))
(global-set-key (kbd "H-e") 'my/visit-emacs-config)

(global-set-key (kbd "H-r")  (lambda () (interactive) (find-file  "~/Dropbox/QMC/Thesis/MPhil_Research.tex")))
(global-set-key (kbd "H-T")  (lambda () (interactive) (find-file  "~/texmf/tex/latex/package_repository/mypackage.sty")))

(global-set-key (kbd "M-]") 'other-window)

(global-set-key (kbd "M-[") 'other-frame)

(global-set-key (kbd "M-n") 'forward-paragraph)
(global-set-key (kbd "M-p") 'backward-paragraph)

(global-set-key (kbd "H-]") 'ace-window)
(setq aw-keys '(?q ?w ?e ?a ?s ?d ?z ?x ?c))

(global-set-key (kbd "H-s") 'helm-spotify-plus)

(defun duplicate-current-line-or-region (arg)
  "Duplicates the current line or region ARG times.
If there's no region, the current line will be duplicated. However, if
there's a region, all lines that region covers will be duplicated."
  (interactive "p")
  (let (beg end (origin (point)))
    (if (and mark-active (> (point) (mark)))
        (exchange-point-and-mark))
    (setq beg (line-beginning-position))
    (if mark-active
        (exchange-point-and-mark))
    (setq end (line-end-position))
    (let ((region (buffer-substring-no-properties beg end)))
      (dotimes (i arg)
        (goto-char end)
        (newline)
        (insert region)
        (setq end (point)))
      (goto-char (+ origin (* (length region) arg) arg)))))
(global-set-key (kbd "H-D") 'duplicate-current-line-or-region)

(defun my/open-term-other-window ()
  (interactive)
  (let ((buf (term "/bin/bash")))
    (switch-to-buffer (other-buffer buf))
    (switch-to-buffer-other-window buf)))
(global-set-key (kbd "C-x 4 t") 'my/open-term-other-window)

(defun my/repeat-last-shell-command()
  "repeats last run shell command"
  (interactive)
  (shell-command (cadr (assoc 'shell-command command-history))))
(global-set-key (kbd "M-Z") 'my/repeat-last-shell-command)

(defun move-line-up ()
  (interactive)
  (transpose-lines 1)
  (previous-line 2))

(defun move-line-down ()
  (interactive)
  (forward-line 1)
  (transpose-lines 1)
  (previous-line 1))

(global-set-key (kbd "M-<up>") 'move-line-up)
(global-set-key (kbd "M-<down>") 'move-line-down)

(require 'god-mode)
(global-set-key (kbd "H-;") 'god-mode)
(define-key god-local-mode-map (kbd ".") 'repeat)

(helm-mode 1)
(require 'helm)
(require 'helm-config)
(global-set-key (kbd "M-x") 'helm-M-x)
(global-set-key (kbd "C-x C-f") 'helm-find-files)
(global-set-key (kbd "C-x C-b") 'helm-buffers-list)

(require 'helm-spotify-plus)

(add-to-list 'custom-theme-load-path "~/.emacs.d/CustomTheme")
(load-theme 'anthony-swanking t)

(dolist (hook '(text-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))
