config.org
** PDF Tools

Better PDF viewing inside AucTex
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode))
(setq pdf-view-midnight-colors (cons (face-foreground 'default) (face-background 'default)))

(defun my-pdf-view-mode-hook ()
  (pdf-view-midnight-minor-mode 1)
  (linum-mode 0)
  )
(add-hook 'pdf-view-mode-hook 'my-pdf-view-mode-hook)
(pdf-tools-install)

(setq TeX-view-program-selection '((output-pdf "PDF Tools"))
      TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
      TeX-source-correlate-start-server t)
#+END_SRC

** Utility

Refresh the buffer after compilation
#+BEGIN_SRC emacs-lisp
(add-hook 'TeX-after-compilation-finished-functions
	  #'TeX-revert-document-buffer)
#+END_SRC

Possible latex templates
#+BEGIN_SRC emacs-lisp
(defun InsertTemplate-quickTeX()
  "Insert quickTeX template"
  (interactive)  
  (insert-file "~/Dropbox/Templates/quickTeX.tex")
)
(defun InsertTemplate-reviewTeX()
  "Insert reivewTeX template"
  (interactive)  
  (insert-file "~/Dropbox/Templates/reviewTeX.tex")
)
#+END_SRC

** LaTeX editing major mode

#+BEGIN_SRC emacs-lisp
(require 'tex)
(add-hook 'LaTeX-mode-hook 'my-LaTeX-mode-hook)
(defun my-LaTeX-mode-hook ()
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil)
  (setq TeX-PDF-mode t)
  (visual-line-mode 1)
  (flyspell-mode 1)
  (LaTeX-math-mode 1)
  (TeX-source-correlate-mode 1)
  (outline-minor-mode 1)
  (local-set-key (kbd "C-M-=") '(lambda () (interactive) (insert "&= ")))
  (local-set-key (kbd "C-H-f") '(lambda () (interactive) (insert "frac{")))
  (local-set-key (kbd "C-c b") 'tex-latex-block)
  (local-set-key (kbd "<C-tab>") 'outline-toggle-children)
  )
#+END_SRC

* Coding
** Flycheck

#+BEGIN_SRC emacs-lisp
  (require 'flycheck)
#+END_SRC

** FORTRAN

Auto load in FORTRAN mode for f90 files
#+BEGIN_SRC emacs-lisp
(autoload 'f90-mode "f90" "Fortran 90 mode" t)
#+END_SRC

Insert FORTRAN template
#+BEGIN_SRC emacs-lisp
  (defun InsertTemplate-Fortran()
  (interactive)
  (when (and
         (string-match "\\.f90$" (buffer-file-name))
         (eq 1 (point-max)))
    (insert-file "~/Dropbox/Templates/FortranTemplate.f90")))    
#+END_SRC

Configurations for FORTRAN major mode
#+BEGIN_SRC emacs-lisp
  (add-hook 'f90-mode-hook 'my-f90-mode-hook)
  (add-hook 'f90-mode-hook 'InsertTemplate-Fortran)
  (require 'fortran)
  (defun my-f90-mode-hook () 
    (local-set-key (kbd "H-M-c") (lambda () (interactive) (shell-command "./bashFortran.sh")))
    (local-set-key (kbd "H-t") 'my/f90-comment-header-block)
    (setq f90-font-lock-keywords f90-font-lock-keywords-3)
    '(f90-comment-region "!!!$")
    '(f90-indented-comment-re "!")
    (abbrev-mode 1)                     
    (turn-on-font-lock)                 
    (auto-fill-mode 0)                  
  )
#+END_SRC

Creates a heading in FORTRAN major mode
#+BEGIN_SRC emacs-lisp
(defun my/f90-comment-header-block (title)
  "Inserts a commented title block for f90"
  (interactive "sEnter a title: ")
  (defvar blank-len 1)
  (setq blank-len (/ (- 69 (length title)) 2))
  (newline)
  (dotimes (jj 5)
    (case jj
      ((0 4)
       (indent-for-tab-command)
       (insert "!")
       (dotimes (ii 69) (insert "-"))
       (insert "!")
       (newline))
      ((1 3)
       (indent-for-tab-command)
       (insert "!")
       (dotimes (ii 69) (insert " "))
       (insert "!")
       (newline))
      (2
       (indent-for-tab-command)
       (insert "!")
       (dotimes (ii blank-len)
	 (insert " "))
       (if (= (mod (length title) 2) 0)
	   (insert " ")
	 )
       (insert title)
       (dotimes (ii blank-len)
	 (insert " "))
       (insert "!")
       (newline))
  )))
#+END_SRC

Recompile FORTRAN numerical libraries 
#+BEGIN_SRC emacs-lisp
  (defun numFort-recompile ()
    "Recompile personal FORTRAN numerical libraries"
    (interactive)
    (shell-command (concat "(cd /home/anthony/Dropbox/Code/Fortran/f90-toolbox/; ./recompile.sh") ))
#+END_SRC

** Python

Insert a template for a python document
#+BEGIN_SRC emacs-lisp
  (defun InsertTemplate-Python()
    (interactive)
    (when (and
    (string-match "\\.py$" (buffer-file-name))
    (eq 1 (point-max)))
    (insert-file "~/Dropbox/Templates/PythonTemplate.py")))    
#+END_SRC

Some configurations Python major mode
#+BEGIN_SRC emacs-lisp
  (require 'python)
  (add-hook 'python-mode-hook 'my-python-mode-hook)
  (add-hook 'find-file-hooks 'InsertTemplate-Python)
  (defun my-python-mode-hook()     
    (local-set-key (kbd "C-c C-r") 'ipython-shell-send-region)
    (setq python-shell-interpreter "~/anaconda3/bin/ipython3"
          python-shell-interpreter-args "--simple-prompt -i")
    (abbrev-mode 1)                     
    )
#+END_SRC

** C++

Load in C++ major mode for .h files
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
#+END_SRC

Insert a template for a C++ document
#+BEGIN_SRC emacs-lisp
  (add-hook 'find-file-hooks 'InsertTemplate-C++)
  (defun InsertTemplate-C++()
    (interactive)
    (when (and
    (string-match "\\.cpp$" (buffer-file-name))
    (eq 1 (point-max)))
    (insert-file "~/Dropbox/Templates/c++template.cpp")))    
#+END_SRC

Some configurations C++ major mode
#+BEGIN_SRC emacs-lisp
(require 'cl)
(add-hook 'c++-mode-hook 'my-c++-mode-hook)
(defun my-c++-mode-hook ()
  (local-set-key (kbd "H-M-p")(lambda () (interactive) (shell-command "./bash_c++")))
  )
#+END_SRC

** Julia

Add paths to inferior julia shell and mode
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/elpa/julia-mode-20180816.2117/")
  (add-to-list 'load-path "~/.emacs.d/elpa/julia-shell-20161125.1910/")
  (require 'julia-mode)
#+END_SRC

Open up a Julia terminal below
#+BEGIN_SRC emacs-lisp
  (defun my/julia-set-up ()
  "Runs inferior julia shell and an emulated julia terminal via term"
    (interactive)
    (let ((w (split-window-right)))    
      (select-window w)
      (inferior-julia-shell)
      (abbrev-mode 1))
    (let ((w (split-window-below)))    
      (select-window w)
      (term "/home/anthony/bin/compilers/julia")
      (abbrev-mode 1))
    )
#+END_SRC

My Julia mode hooks
#+BEGIN_SRC emacs-lisp
  (defun my-julia-mode-hooks ()
    (require 'julia-shell)
    (abbrev-mode 1)                     
    (local-set-key (kbd "C-c C-r") 'julia-shell-run-region)
    (local-set-key (kbd "C-c C-c") 'julia-shell-run-region-or-line)
    (local-set-key (kbd "C-c C-s") 'julia-shell-save-and-go)
    (local-set-key (kbd "C-c C-p") 'my/julia-set-up)
    )
  (add-hook 'julia-mode-hook 'my-julia-mode-hooks)
#+END_SRC

#+RESULTS:
| my-julia-mode-hooks |
* Org
** Editing Code

Some configurations Org major mode
#+BEGIN_SRC emacs-lisp
(defun my-org-mode-hook ()
  (setq org-log-done t)
  (define-key global-map "\C-cl" 'org-store-link)
  (define-key global-map "\C-ca" 'org-agenda)
  (visual-line-mode 1)
  (org-indent-mode 1)
  (org-bullets-mode 1)
  (abbrev-mode 1)
  ;; (linum-mode 1)
)
#+END_SRC

load mode
#+BEGIN_SRC emacs-lisp
(autoload 'org-mode "org" "Org Mode" t)
(add-hook 'org-mode-hook 'my-org-mode-hook)
#+END_SRC

load in certain languages coding modes
#+BEGIN_SRC emacs-lisp
  (require 'ob-clojure)
  (require 'ox-latex)
  (require 'org)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (python . t)
     (fortran . t)
    (latex . t)
     (shell . t)
     (emacs-lisp . t)
     ))
#+END_SRC

** Capture Mode

Add custom section titles templates
#+BEGIN_SRC emacs-lisp
    (setq org-capture-templates
          (quote (("n" "Notes" entry (file "~/Dropbox/QMC/Notes/Notes.org")
                   "* %? D/11/2018 \n** Contents \n \n** Notes \n \n** Resources ")        
                  ("Q" "Question" entry (file "~/Dropbox/QMC/Notes/Questions.org")
                   "* %?")
                  )))
#+END_SRC

Set org agenda files maybe
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-files '("~/Dropbox/QMC/Notes/"))
#+END_SRC
** Key Bindings

Some key bindings for Org
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "H-/") 'org-tags-view)
#+END_SRC


