config.el

(add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode))
(setq pdf-view-midnight-colors (cons (face-foreground 'default) (face-background 'default)))

(defun my-pdf-view-mode-hook ()
  (pdf-view-midnight-minor-mode 1)
  (linum-mode 0)
  )
(add-hook 'pdf-view-mode-hook 'my-pdf-view-mode-hook)
(pdf-tools-install)

(setq TeX-view-program-selection '((output-pdf "PDF Tools"))
      TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
      TeX-source-correlate-start-server t)

(add-hook 'TeX-after-compilation-finished-functions
	  #'TeX-revert-document-buffer)

(defun InsertTemplate-quickTeX()
  "Insert quickTeX template"
  (interactive)  
  (insert-file "~/Dropbox/Templates/quickTeX.tex")
)
(defun InsertTemplate-reviewTeX()
  "Insert reivewTeX template"
  (interactive)  
  (insert-file "~/Dropbox/Templates/reviewTeX.tex")
)

(require 'tex)
(add-hook 'LaTeX-mode-hook 'my-LaTeX-mode-hook)
(defun my-LaTeX-mode-hook ()
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil)
  (setq TeX-PDF-mode t)
  (visual-line-mode 1)
  (flyspell-mode 1)
  (LaTeX-math-mode 1)
  (TeX-source-correlate-mode 1)
  (outline-minor-mode 1)
  (local-set-key (kbd "C-M-=") '(lambda () (interactive) (insert "&= ")))
  (local-set-key (kbd "C-H-f") '(lambda () (interactive) (insert "frac{")))
  (local-set-key (kbd "C-c b") 'tex-latex-block)
  (local-set-key (kbd "<C-tab>") 'outline-toggle-children)
  )

(autoload 'f90-mode "f90" "Fortran 90 mode" t)

(defun InsertTemplate-Fortran()
(interactive)
(when (and
       (string-match "\\.f90$" (buffer-file-name))
       (eq 1 (point-max)))
  (insert-file "~/Dropbox/Templates/FortranTemplate.f90")))

(add-hook 'f90-mode-hook 'my-f90-mode-hook)
(add-hook 'f90-mode-hook 'InsertTemplate-Fortran)
(require 'fortran)
(defun my-f90-mode-hook () 
  (local-set-key (kbd "H-M-c") (lambda () (interactive) (shell-command "./bashFortran.sh")))
  (local-set-key (kbd "H-t") 'my/f90-comment-header-block)
  (setq f90-font-lock-keywords f90-font-lock-keywords-3)
  '(f90-comment-region "!!!$")
  '(f90-indented-comment-re "!")
  (abbrev-mode 1)                     
  (turn-on-font-lock)                 
  (auto-fill-mode 0)                  
)

(defun my/f90-comment-header-block (title)
  "Inserts a commented title block for f90"
  (interactive "sEnter a title: ")
  (defvar blank-len 1)
  (setq blank-len (/ (- 69 (length title)) 2))
  (newline)
  (dotimes (jj 5)
    (case jj
      ((0 4)
       (indent-for-tab-command)
       (insert "!")
       (dotimes (ii 69) (insert "-"))
       (insert "!")
       (newline))
      ((1 3)
       (indent-for-tab-command)
       (insert "!")
       (dotimes (ii 69) (insert " "))
       (insert "!")
       (newline))
      (2
       (indent-for-tab-command)
       (insert "!")
       (dotimes (ii blank-len)
	 (insert " "))
       (if (= (mod (length title) 2) 0)
	   (insert " ")
	 )
       (insert title)
       (dotimes (ii blank-len)
	 (insert " "))
       (insert "!")
       (newline))
  )))

(defun numFort-recompile ()
  "Recompile personal FORTRAN numerical libraries"
  (interactive)
  (shell-command (concat "(cd /home/anthony/Dropbox/Code/Fortran/f90-toolbox/; ./recompile.sh") ))

(defun InsertTemplate-Python()
  (interactive)
  (when (and
  (string-match "\\.py$" (buffer-file-name))
  (eq 1 (point-max)))
  (insert-file "~/Dropbox/Templates/PythonTemplate.py")))

(require 'python)
(add-hook 'python-mode-hook 'my-python-mode-hook)
(add-hook 'find-file-hooks 'InsertTemplate-Python)
(defun my-python-mode-hook()     
  (local-set-key (kbd "C-c C-r") 'ipython-shell-send-region)
  (setq python-shell-interpreter "~/anaconda3/bin/ipython3"
        python-shell-interpreter-args "--simple-prompt -i")
  (abbrev-mode 1)                     
  )

(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))

(add-hook 'find-file-hooks 'InsertTemplate-C++)
(defun InsertTemplate-C++()
  (interactive)
  (when (and
  (string-match "\\.cpp$" (buffer-file-name))
  (eq 1 (point-max)))
  (insert-file "~/Dropbox/Templates/c++template.cpp")))

(require 'cl)
(add-hook 'c++-mode-hook 'my-c++-mode-hook)
(defun my-c++-mode-hook ()
  (local-set-key (kbd "H-M-p")(lambda () (interactive) (shell-command "./bash_c++")))
  )

(add-to-list 'load-path "~/.emacs.d/elpa/julia-mode-20180816.2117/")
(add-to-list 'load-path "~/.emacs.d/elpa/julia-shell-20161125.1910/")
(require 'julia-mode)

(defun my/julia-set-up ()
"Runs inferior julia shell and an emulated julia terminal via term"
  (interactive)
  (let ((w (split-window-right)))    
    (select-window w)
    (inferior-julia-shell)
    (abbrev-mode 1))
  (let ((w (split-window-below)))    
    (select-window w)
    (term "/home/anthony/bin/compilers/julia")
    (abbrev-mode 1))
  )

(defun my-julia-mode-hooks ()
  (require 'julia-shell)
  (abbrev-mode 1)                     
  (local-set-key (kbd "C-c C-r") 'julia-shell-run-region)
  (local-set-key (kbd "C-c C-c") 'julia-shell-run-region-or-line)
  (local-set-key (kbd "C-c C-s") 'julia-shell-save-and-go)
  (local-set-key (kbd "C-c C-p") 'my/julia-set-up)
  )
(add-hook 'julia-mode-hook 'my-julia-mode-hooks)

(defun my-org-mode-hook ()
  (setq org-log-done t)
  (define-key global-map "\C-cl" 'org-store-link)
  (define-key global-map "\C-ca" 'org-agenda)
  (visual-line-mode 1)
  (org-indent-mode 1)
  (org-bullets-mode 1)
  (abbrev-mode 1)
  ;; (linum-mode 1)
)

(autoload 'org-mode "org" "Org Mode" t)
(add-hook 'org-mode-hook 'my-org-mode-hook)

(require 'ob-clojure)
(require 'ox-latex)
(require 'org)
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (python . t)
   (fortran . t)
  (latex . t)
   (shell . t)
   (emacs-lisp . t)
   ))

(setq org-capture-templates
      (quote (("n" "Notes" entry (file "~/Dropbox/QMC/Notes/Notes.org")
               "* %? D/11/2018 \n** Contents \n \n** Notes \n \n** Resources ")        
              ("Q" "Question" entry (file "~/Dropbox/QMC/Notes/Questions.org")
               "* %?")
              )))

(setq org-agenda-files '("~/Dropbox/QMC/Notes/"))

(global-set-key (kbd "C-c l") 'org-store-link)
