config.org
** Macros

Keyboard macros for org mode
#+BEGIN_SRC emacs-lisp
   (global-set-key (kbd "C-c l") 'org-store-link)
   (global-set-key (kbd "C-c a") 'org-agenda)
   (global-set-key (kbd "C-c c") 'org-capture)
#+END_SRC

Code block macros
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("c" "#+BEGIN_SRC C++\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("ipy" "#+BEGIN_SRC ipython :session :exports both :results raw drawer\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("f" "#+BEGIN_SRC fortran\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("y" "#+BEGIN_SRC yaml\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("sh" "#+BEGIN_SRC shell\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("t" "#+BEGIN_SRC text\n  ?\n#+END_SRC"))
#+END_SRC

** Utility

Translate regular ol' straight quotes to typographically-correct curly quotes
when exporting.
#+BEGIN_SRC emacs-lisp
   (setq org-export-with-smart-quotes t)
#+END_SRC

Don't ask before evaluating code blocks.
#+BEGIN_SRC emacs-lisp
   (setq org-confirm-babel-evaluate nil)
#+END_SRC

For exporting to HTML
#+BEGIN_SRC emacs-lisp
   (require  'htmlize)
#+END_SRC

** Visual Settings

Nice ellipsis:
#+BEGIN_SRC emacs-lisp
   (setq org-ellipsis "⬎")
#+END_SRC

Use syntax highlighting in source blocks while editing (you may already have this).
#+BEGIN_SRC emacs-lisp
   (setq org-src-fontify-natively t)
#+END_SRC

When editing a code snippet, use the current window rather than popping open a new one.
#+BEGIN_SRC emacs-lisp
   (setq org-src-window-setup 'current-window)
#+END_SRC

Automatic indentation upon startup (or set to nil if you don't want it)
#+BEGIN_SRC emacs-lisp
  (setq org-startup-indented t)
#+END_SRC

Change Org bullets appearance
#+BEGIN_SRC emacs-lisp
(setq org-bullets-face-name (quote org-bullet-face))
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(setq org-bullets-bullet-list '("➢" "➣" "➤" "➟" "➙" "»")) 
#+END_SRC

** Agenda alternations

Add states for to do lists
#+BEGIN_SRC emacs-lisp 
  (setq org-todo-keywords '((sequence "☛ TODO(t)" "|" "✔ DONE(d)") ;
                            (sequence "⚑ WAITING(w)" "|")
                            (sequence "|" "💀 DEAD(d)")
                            ))
#+END_SRC

** LaTeX

Use =mypackage= package for all LaTeX exports.
#+BEGIN_SRC emacs-lisp
(setq org-latex-packages-alist '())
  (add-to-list 'org-latex-packages-alist '("" "mypackage" t))
#+END_SRC

Tell org where to find LaTeX
#+BEGIN_SRC emacs-lisp
  (setq exec-path (append exec-path '("/usr/bin")))
  (load "auctex.el" nil t t)
#+END_SRC







