config.el
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)

(add-to-list 'org-structure-template-alist
             '("el" "#+BEGIN_SRC emacs-lisp\n  ?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist
             '("c" "#+BEGIN_SRC C++\n  ?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist
             '("ipy" "#+BEGIN_SRC ipython :session :exports both :results raw drawer\n  ?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist
             '("f" "#+BEGIN_SRC fortran\n  ?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist
             '("y" "#+BEGIN_SRC yaml\n  ?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist
             '("sh" "#+BEGIN_SRC shell\n  ?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist
             '("t" "#+BEGIN_SRC text\n  ?\n#+END_SRC"))

(setq org-export-with-smart-quotes t)

(setq org-confirm-babel-evaluate nil)

(require  'htmlize)

(setq org-ellipsis "⤵")

(setq org-src-fontify-natively t)

(setq org-src-window-setup 'current-window)

(setq org-startup-indented t)

(setq org-bullets-face-name (quote org-bullet-face))
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(setq org-bullets-bullet-list '("➢" "➣" "➤" "➟" "➙" "»"))

(setq org-todo-keywords '((sequence "☛ TODO(t)" "|" "✔ DONE(d)") ;
                          (sequence "⚑ WAITING(w)" "|")
                          (sequence "|" "💀 DEAD(d)")
                          ))

(setq org-latex-packages-alist '())
  (add-to-list 'org-latex-packages-alist '("" "mypackage" t))

(setq exec-path (append exec-path '("/usr/bin")))
(load "auctex.el" nil t t)
